import App from './App.vue'
export default [
  {
    path: '/',
    component: App.components.Home,
    name: 'index'
  },
  {
    path: '/about',
    component: App.components.About,
    name: 'about'
  },
  {
    path: '/main',
    component: App.components.Main,
    name: 'main'
  },
]
// {
//   '/': 'Home',
//   '/vue-demo2/': 'Home',
//   '/about': 'About',
//    '/0101': '0101',
//    '/0102': '0102',
//    '/0103': '0103',
//    '/0104': '0104',
//    '/0105': '0105',
//    '/0106': '0106',
//    '/0107': '0107',
//    '/0108': '0108',
//    '/0109': '0109',
//    '/0110': '0110',
//    '/0111': '0111',
//    '/0112': '0112',
//    '/0201': '0201',
//    '/0202': '0202',
//    '/0203': '0203',
//    '/0204': '0204',
//    '/0205': '0205',
//    '/0206': '0206',
//    '/0207': '0207',
//    '/0208': '0208'
// }
/* 
  当你走进这欢乐场
  背上所有的梦与想
  各色的脸上各色的妆
  没人记得你的模样
  三巡酒过你在角落
  固执的唱着苦涩的歌
  听他在喧嚣里被淹没
  你拿起酒杯对自己说
  一杯敬朝阳，一杯敬月光
  唤醒我的向往，温柔了寒窗
  于是可以不回头的逆风飞翔
  不怕心头有雨，眼底有霜
  一杯敬故乡，一杯敬远方
  守着我的善良，催着我成长
  所以南北的路从此不再漫长
  灵魂不再无处安放
  一杯敬明天，一杯敬过往
  支撑我的身体，厚重了肩膀
  虽然从不相信所谓山高水长
  人生苦短何必念念不忘
  一杯敬自由，一杯敬死亡
  宽恕我的平凡，驱散了迷惘
  好吧天亮之后总是潦草离场
  清醒的人最荒唐
  好吧天亮之后总是潦草离场
  清醒的人最荒唐
*/